var ARR_DIMOND = [
    ['谱尼', 37338, 0.555],
    ['卡修斯', 20087, 0.548],
    ['恶灵兽', 18987, 0.559],
    ['亚斯塔禄', 16061, 0.553],
    ['托鲁克', 15838, 0.538],
    ['阿瑞斯', 14169, 0.557],
    ['德莱坦', 13405, 0.533],
    ['赛伯斯特', 11428, 0.564],
    ['巴斯特', 8341, 0.579],
    ['英普瑞思', 9957, 0.555],
    ['库贝萨', 8341, 0.579],
    ['SP圣光天马', 6350, 0.579],
    ['瑟杰科', 3201, 0.636],
    ['圣光天马', 1348, 0.591],
    ['菲尼克斯', 1098, 0.624]
];
var ARR_KING = [
    ['恶灵兽', 28820, 0.57],
    ['谱尼', 27502, 0.56],
    ['库贝萨', 24773, 0.555],
    ['赛伯斯特', 22160, 0.567],
    ['阿瑞斯', 18117, 0.563],
    ['亚斯塔禄', 16087, 0.571],
    ['英普瑞思', 14126, 0.568],
    ['瑟杰科', 10257, 0.576],
    ['托鲁克', 9499, 0.563],
    ['德莱坦', 8150, 0.536],
    ['巴斯特', 3039, 0.635],
    ['菲尼克斯', 1098, 0.612],
    ['SP圣光天马', 729, 0.635],
    ['圣光天马', 88, 0.693],
    // 新增
    ['泰兰达姆', 10676, 0.564],
    ['玛法里奥', 7339, 0.56],
    ['霍丹姆', 6364, 0.536],
    ['霍利莱恩', 6275, 0.581],
    ['斯兰德', 4273, 0.578],
    ['昆仑', 3936, 0.561],
    ['炽翼火龙', 2708, 0.578],
    ['艾瑞尔', 1367, 0.594],
    ['萨瑞卡', 1257, 0.599],
    ['加布', 889, 0.593],
    ['可泰勒', 793, 0.607],
    ['尤菲娜', 715, 0.608],
    ['叶尔茜', 650, 0.592],
    ['希卢卡', 639, 0.636],
    ['泰格尔', 524, 0.637]
    // 淘汰
    // ['卡修斯', 2724, 0.542],
];
var ARR_TOP = [
    ['库贝萨', 18222, 0.579],
    ['赛伯斯特', 13222, 0.584],
    ['谱尼', 12536, 0.574],
    ['恶灵兽', 12356, 0.586],
    ['英普瑞思', 11806, 0.579],
    ['阿瑞斯', 11641, 0.573],
    ['亚斯塔禄', 7707, 0.586],
    ['泰兰达姆', 6734, 0.559],
    ['瑟杰科', 6223, 0.581],
    ['玛法里奥', 4711, 0.578],
    ['霍丹姆', 4231, 0.567],
    ['德莱坦', 3152, 0.576],
    ['托鲁克', 3095, 0.595],
    ['霍利莱恩', 2161, 0.602]
];
var COUNT_DIMOND = 54000;
var COUNT_KING = 55000;
var COUNT_TOP = 28000;

function p(p = 37338, w = 0.555, c = COUNT_TOP) {
    const opLoseDiffer = p * (2 * w - 1);
    const opC = c - p || 1;
    const opLoseC = (opC + opLoseDiffer) / 2;
    const opLoseP = opLoseC / opC;
    return opLoseP;
}

function l(a = ARR_TOP) {
    a.map((item) => {
        const tp = p(item[1], item[2]);
        return {
            name: item[0],
            tp
        };
    })
        .sort((a, b) => {
            return a.tp > b.tp ? -1 : 1;
        })
        .forEach((item, index) => {
            console.log(`${index + 1}.${item.name}:`, item.tp);
        });
}
